Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/presidents_role_in_summoning_and_dissolving_the_dail.html.txt.tmx
Source language: en
Languages: ga

source: President - Summoning and dissolving the Dáil
ga: An tUachtarán - an Dáil a chomóradh agus a lánscoir

source: Following a general election, Dáil Éireann is summoned by the Irish President on the advice of the Taoiseach (the Prime Minister)
ga: Tar éis olltoghcháin, déanann an tUachtarán Dáil Éireann a chomóradh ar chomhairle an Taoisigh

source: The President must follow the advice of the Taoiseach
ga: Ní mór don Uachtarán glacadh le comhairle an Taoisigh

source: The President also has the power to dissolve or end the Dáil on the advice of the Taoiseach
ga: Is féidir leis an Uachtarán an Dáil a lánscoir ar chomhairle an Taoisigh

source: If the Taoiseach has the support of the majority of Dáil Eireann, the President cannot refuse to dissolve it
ga: Má tá tacaíocht tromlach na dTeachtaí i nDáil Éireann ag an Taoiseach, ní féidir leis an Uachtarán diúltú an Dáil a lánscoir

source: If the Taoiseach no longer has the support of the majority of Dáil Éireann and they advise the President to dissolve the Dáil, the President may refuse
ga: Muna bhfuil tacaíocht tromlach na dTeachtaí i nDáil Éireann ag an Taoiseach a thuilleadh agus má iarrann sé/sí ar an Uachtarán an Dáil a lánscoir, is féidir leis an Uachtarán diúltú é sin a dhéanamh

source: If the President refuses to dissolve the Dáil, the members of the Dáil must then nominate an alternative Government
ga: Má dhiúltaíonn an tUachtarán an Dáil a lánscoir ní mór ansin do theachtaí na Dála Rialtas eile a mholadh

source: Since the foundation of the State, this power of refusal has never been exercised
ga: Níor tharla sé ariamh gur dhiúltaigh Uachtarán an Dáil a lánscoir
